In [299]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [300]:
data = pd.read_csv(r"C:\Users\visha\Downloads\ms-Census_incomedec14\census-income_ (1).csv",na_values='?',skipinitialspace=True)

In [301]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,Unnamed: 14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [302]:
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'Unnamed: 14'],
      dtype='object')

In [303]:
data.columns = data.columns.str.replace('-','.')

In [304]:
data.columns = data.columns.str.replace(' ','_')

In [305]:
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education.num',
       'marital.status', 'occupation', 'relationship', 'race', 'sex',
       'capital.gain', 'capital.loss', 'hours.per.week', 'native.country',
       'Unnamed:_14'],
      dtype='object')

In [306]:
data.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
Unnamed:_14          0
dtype: int64

In [307]:
data.shape

(32561, 15)

In [308]:
data = data.dropna()

In [309]:
# Data Manipulation
# Q1-PDF

census_ed = data[['education']]

In [310]:
census_ed

        education
0       Bachelors
1       Bachelors
2         HS-grad
3            11th
4       Bachelors
...           ...
32556  Assoc-acdm
32557     HS-grad
32558     HS-grad
32559     HS-grad
32560     HS-grad

[30162 rows x 1 columns]

In [311]:
# Q2-PDF

census_seq = data.iloc[:,0:8]
census_seq

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife
...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife

In [312]:
# Q3-PDF
census_col = data.iloc[:,[5,8,11]]
census_col

           marital.status   race  capital.loss
0           Never-married  White             0
1      Married-civ-spouse  White             0
2                Divorced  White             0
3      Married-civ-spouse  Black             0
4      Married-civ-spouse  Black             0
...                   ...    ...           ...
32556  Married-civ-spouse  White             0
32557  Married-civ-spouse  White             0
32558             Widowed  White             0
32559       Never-married  White             0
32560  Married-civ-spouse  White             0

[30162 rows x 3 columns]

In [313]:
male_gov = data[data['workclass']=='State-gov']

In [314]:
male_gov = male_gov[male_gov['sex']=='Male']

In [315]:
male_gov['sex'].value_counts()

Male    795
Name: sex, dtype: int64

In [316]:
# Q4-PDF

census = data[data['age']==39]

census_us = census[(census['education']=='Bachelors') | (census['native.country']=='United-States')]

In [317]:
census_us.shape

(742, 15)

In [318]:
# Q5-PDF

census_200 = data.sample(200)
census_200

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,Unnamed:_14
25760,48,State-gov,120131,HS-grad,9,Divorced,Craft-repair,Own-child,White,Male,8614,0,40,United-States,>50K
8325,50,State-gov,116211,Prof-school,15,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,52,United-States,>50K
19458,52,Private,48343,Assoc-voc,11,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,40,United-States,<=50K
6450,21,Private,194096,Some-college,10,Never-married,Other-service,Own-child,White,Female,0,0,40,United-States,<=50K
28473,31,Private,373185,Some-college,10,Never-married,Craft-repair,Unmarried,White,Male,0,0,42,Mexico,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30770,24,Private,202721,Some-college,10,Never-married,Adm-clerical,Own-child,Black,Female,0,0,40,United-States,<=50K
30958,18,Private,205218,11th,7,Never-married,Sales,Own-child,White,Female,0,0,20,United-States,<=50K
1418,31,Private,127610,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,White,Female,0,0,40,United-States,>50K
3064,41,Private,79797,HS-grad,9,Married-spouse-absent,Prof-specialty,Not-in-family,Asian-Pac-Islander,Male,0,0,40,Japan,>50K
13040,28,Private,190060,HS-grad,9,Married-civ-spouse,Sales,Husband,White,Male,0,0,40,United-States,>50K

In [319]:
# Q6-PDF

In [320]:
data['workclass'].value_counts()

Private             22286
Self-emp-not-inc     2499
Local-gov            2067
State-gov            1279
Self-emp-inc         1074
Federal-gov           943
Without-pay            14
Name: workclass, dtype: int64

In [321]:
data['capital.gain'].mean()

1092.0078575691268

In [322]:
# Q7-PDF

In [323]:
data.groupby(by='workclass')['capital.gain'].mean()

workclass
Federal-gov          832.321315
Local-gov            829.230285
Private              879.858207
Self-emp-inc        4810.746741
Self-emp-not-inc    1913.134454
State-gov            684.306489
Without-pay          487.857143
Name: capital.gain, dtype: float64

In [324]:
data.rename(columns={'Unnamed:_14':'Income'},inplace = True)

In [325]:
data.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,Income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [326]:
data['sex'].value_counts()

Male      20380
Female     9782
Name: sex, dtype: int64

In [327]:
# Male person earning more than 50K

male_50k = data[(data['Income']=='>50K') & (data['sex']=='Male')]

In [328]:
male_50k.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,Income
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
10,37,Private,280464,Some-college,10,Married-civ-spouse,Exec-managerial,Husband,Black,Male,0,0,80,United-States,>50K
11,30,State-gov,141297,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K
20,40,Private,193524,Doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,60,United-States,>50K

In [329]:
# Male person earning more than 50K

female_50k = data[(data['Income']=='>50K') & (data['sex']=='Female')]

In [330]:
female_50k.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,Income
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
19,43,Self-emp-not-inc,292175,Masters,14,Divorced,Exec-managerial,Unmarried,White,Female,0,0,45,United-States,>50K
52,47,Private,51835,Prof-school,15,Married-civ-spouse,Prof-specialty,Wife,White,Female,0,1902,60,Honduras,>50K
67,53,Private,169846,HS-grad,9,Married-civ-spouse,Adm-clerical,Wife,White,Female,0,0,40,United-States,>50K
84,44,Private,343591,HS-grad,9,Divorced,Craft-repair,Not-in-family,White,Female,14344,0,40,United-States,>50K

In [331]:
# percentage of people earning  less than 50K & from USA & working in Private

pep_under_50k = data[(data['native.country']=='United-States') & (data['workclass']=='Private') & (data['Income']=='<=50K')]
total = len(data)
percentage=(len(pep_under_50k)/total)*100
percentage

51.70081559578277

In [332]:
data['marital.status'].value_counts()

Married-civ-spouse       14065
Never-married             9726
Divorced                  4214
Separated                  939
Widowed                    827
Married-spouse-absent      370
Married-AF-spouse           21
Name: marital.status, dtype: int64

In [333]:
# percentage of people who are married

total = len(data['marital.status'])
marrd_pepl = 14065+939+370+21 
marrd_percnt = (marrd_pepl/total)*100
marrd_percnt

51.04104502353955

In [334]:
# calculating percentage of people graduated from high school earning morer than 50K annualy

data['education'].value_counts()

HS-grad         9840
Some-college    6678
Bachelors       5044
Masters         1627
Assoc-voc       1307
11th            1048
Assoc-acdm      1008
10th             820
7th-8th          557
Prof-school      542
9th              455
12th             377
Doctorate        375
5th-6th          288
1st-4th          151
Preschool         45
Name: education, dtype: int64

In [335]:
HS_50K = data[(data['education']=='HS-grad') & (data['Income']=='>50K')]
len(HS_50K)

1617

In [336]:
HS_graduate = (len(HS_50K)/len(data))*100
HS_graduate

5.361050328227571

# LINEAR REGRESSION

In [337]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

In [338]:
lr = LinearRegression()

y = data[['hours.per.week']]
x = data[['education.num']]

In [339]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=1)

lr.fit(x_train,y_train)

y_pred = lr.predict(x_test)

In [340]:
y_pred #predicted values

array([[40.1516711 ],
       [38.07360531],
       [42.92242549],
       ...,
       [40.1516711 ],
       [38.7662939 ],
       [40.1516711 ]])

In [341]:
y_test # Actual values

       hours.per.week
12488              65
5130               50
8616               15
15453              40
13555              50
...               ...
23848              32
14755              20
11213              20
15473              40
37                 25

[9049 rows x 1 columns]

In [342]:
print('mean_squared_error:' ,mean_squared_error(y_test,y_pred))
print('Root_mean_squared_error:' ,np.sqrt(mean_squared_error(y_test,y_pred)))

mean_squared_error: 134.69130460518096
Root_mean_squared_error: 11.605658301241725

In [343]:
from sklearn.metrics import r2_score

In [344]:
r2_score(y_test,y_pred)

0.02781973266918525

# Logistic Regression

In [345]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler,LabelEncoder
from sklearn.metrics import accuracy_score,confusion_matrix,classification_report

In [346]:
lo = LogisticRegression() # object of logistic regression

In [367]:
x = data['occupation']
x = pd.DataFrame(x) # Independent Variable

In [348]:
data['Income'].value_counts()

<=50K    22654
>50K      7508
Name: Income, dtype: int64

In [349]:
data['occupation'].value_counts()

Prof-specialty       4038
Craft-repair         4030
Exec-managerial      3992
Adm-clerical         3721
Sales                3584
Other-service        3212
Machine-op-inspct    1966
Transport-moving     1572
Handlers-cleaners    1350
Farming-fishing       989
Tech-support          912
Protective-serv       644
Priv-house-serv       143
Armed-Forces            9
Name: occupation, dtype: int64

In [350]:
y = data['Income'].replace('<=50K','0').replace('>50K','1')

In [363]:
y.value_counts()

0    22654
1     7508
Name: Income, dtype: int64

In [368]:
L = LabelEncoder()

In [369]:
x = L.fit_transform(x)

C:\Users\visha\anaconda3\lib\site-packages\sklearn\preprocessing\_label.py:115: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [370]:
x = pd.DataFrame(x)
x.value_counts()

9     4038
2     4030
3     3992
0     3721
11    3584
7     3212
6     1966
13    1572
5     1350
4      989
12     912
10     644
8      143
1        9
dtype: int64

In [371]:
x_train,x_test,y_train,y_test = train_test_split(x,y,random_state=1,test_size=0.35)
lo = LogisticRegression()
lo.fit(x_train,y_train)
y_pred = lo.predict(x_test)

In [372]:
confusion_matrix(y_test,y_pred)

array([[7932,    0],
       [2625,    0]], dtype=int64)

In [358]:
accuracy_score(y_test,y_pred)

0.7513498152884343

In [359]:
d = data[['age','workclass','education']]

In [360]:
x = d.apply(L.fit_transform)
x.head()

   age  workclass  education
0   22          5          9
1   33          4          9
2   21          2         11
3   36          2          1
4   11          2          9

In [361]:
y = data['Income'].replace('<=50K','0').replace('>50K','1')

In [373]:
y

0        0
1        0
2        0
3        0
4        0
        ..
32556    0
32557    1
32558    0
32559    0
32560    1
Name: Income, Length: 30162, dtype: object

In [375]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size=0.2, random_state=1)
Lo = LogisticRegression()
Lo.fit(x_train,y_train)
y_pred = Lo.predict(x_test)

In [376]:
y_pred

array(['0', '0', '0', ..., '0', '0', '0'], dtype=object)

In [377]:

print('confusion_matrix :')
print(confusion_matrix(y_pred,y_test))
print('accuracy_score :',accuracy_score(y_test,y_pred))

confusion_matrix :
[[4483 1550]
 [   0    0]]
accuracy_score : 0.7430797281617769

# Decision Tree Model

In [379]:
from sklearn.tree import DecisionTreeClassifier
data.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,Income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [380]:
data['education'].value_counts()

HS-grad         9840
Some-college    6678
Bachelors       5044
Masters         1627
Assoc-voc       1307
11th            1048
Assoc-acdm      1008
10th             820
7th-8th          557
Prof-school      542
9th              455
12th             377
Doctorate        375
5th-6th          288
1st-4th          151
Preschool         45
Name: education, dtype: int64

In [382]:
data.education= data.education.replace(['Preschool', '1st-4th', '5th-6th', '7th-8th', '9th','10th', '11th', '12th'], 'School')
data.education = data.education.replace(['Assoc-voc', 'Assoc-acdm', 'Prof-school', 'Some-college'], 'Higher')
data['marital.status']= data['marital.status'].replace(['Married-civ-spouse', 'Married-AF-spouse'], 'married')
data['marital.status']= data['marital.status'].replace(['Never-married'], 'not-married')
data['marital.status']= data['marital.status'].replace(['Divorced', 'Separated','Widowed','Married-spouse-absent'], 'other')
data.Income = data.Income.replace('<=50K', 0)
data.Income = data.Income.replace('>50K', 1)
data.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,Income
0,39,State-gov,77516,Bachelors,13,not-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,0
1,50,Self-emp-not-inc,83311,Bachelors,13,married,Exec-managerial,Husband,White,Male,0,0,13,United-States,0
2,38,Private,215646,HS-grad,9,other,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,0
3,53,Private,234721,School,7,married,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,0
4,28,Private,338409,Bachelors,13,married,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,0

In [384]:
data.education.value_counts()

HS-grad      9840
Higher       9535
Bachelors    5044
School       3741
Masters      1627
Doctorate     375
Name: education, dtype: int64

In [386]:
data = data.apply(L.fit_transform)
data.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,Income
0,22,5,2491,0,12,1,0,1,4,1,24,0,39,38,0
1,33,4,2727,0,12,0,3,0,4,1,0,0,12,38,0
2,21,2,13188,2,8,2,5,1,4,1,0,0,39,38,0
3,36,2,14354,5,6,0,5,0,2,1,0,0,39,38,0
4,11,2,18120,0,12,0,9,5,2,0,0,0,39,4,0

In [387]:
x = data.iloc[:,:-1]
y = data.iloc[:,-1]

In [388]:
x_train,x_test,y_train,y_test = train_test_split(x,y, random_state=1,test_size=0.3)
dt = DecisionTreeClassifier()
dt.fit(x_train,y_train)
y_pred = dt.predict(x_test)

In [399]:
print(f'confusion matrix : {confusion_matrix(y_test,y_pred)}')
print(f'Accuraccy Score {accuracy_score(y_test,y_pred)}')

confusion matrix : [[5900  869]
 [ 884 1396]]
Accuraccy Score 0.806276936678086

# Random Forest

In [400]:
from sklearn.ensemble import RandomForestClassifier

In [ ]:
rd = RandomForestClassifier()
x_train,x_test,y_train,y_test = train_test_split(x,y, random_state=1,test_size=0.25)
rd.fit(x_train,y_train)
y_pred = rd.predict(x_test)

In [ ]:
print(f'Accuracy Score : {accuracy_score(y_test,y_pred)}')
print(f'Confusion matrix : {confusion_matrix(y_test,y_pred)}')